app/Controllers/AgendaController.php

INSERT INTO `horarios` (`horario`, `data`, `telefone`, `observacao`, `disponivel`, `email_usuario`) VALUES ('08:00', '2024-01-17', '33999414866', '', 0, 'eu@gmail.com')
---
    public function dadosAgendar()
    {
        $horario = $this->request->getPost('horario');
        $data = $this->request->getPost('data');
        $telefone = $this->request->getPost('telefone');
        $observacao = $this->request->getPost('observacao');


        $session = session();

        $usuario = $session->get('email');


        $dados = [
            'horario' => $horario,
            'data' => $data,
            'telefone' => $telefone,
            'observacao' => $observacao,
            'disponivel' => false,
            'email_usuario' => $usuario
        ];

        $horarioModel = new \App\Models\HorarioModel();


        $horarioModel->insert($dados);

DELETE FROM `horarios`
WHERE `horario` = '08:00:00'
AND `data` = '2024-01-17'
---
    public function ExcluirHorario()
    {

        $horario = $this->request->getPost('horarioExcluir');
        $data = $this->request->getPost('dataExcluir');



        $horarioModel = new \App\Models\HorarioModel();


        $horarioModel->where('horario',  $horario);
        $horarioModel->where('data',  $data);
        $horarioModel->delete();