app/Models/horarioModel.php

SELECT `disponivel`
FROM `horarios`
WHERE `disponivel` = 0
---
    public function getDisponibilidade (){

        $query = $this->db->table('horarios')->select('disponivel')->where('disponivel', false)->get();

SELECT `horario`, `data`
FROM `horarios`
---
    public function gethorarios (){

        $query = $this->db->table('horarios')->select('horario')->select('data')->get();

SELECT `horario`, `data`, `telefone`
FROM `horarios`
WHERE `email_usuario` = 'eu@gmail.com'
---
    public function getUsuarioHorario ($email){

        $query = $this->db->table('horarios')->select('horario')->select('data')->select('telefone')->where('email_usuario', $email)->get();