app/Models/usuarioModel.php

SELECT *
FROM `usuario`
WHERE `email` = 'eu@gmail.com'
---
    public function getUsuario ($email){

        $query = $this->db->table('usuario')->where('email', $email)->get();